Creating a DataFrame

In [2]:
import numpy as np 
import pandas as pd

In [3]:
data={
    'Name':['John','Anna','Peter','Linda'],
    'Age':[28,34,29,42],
    'City':['New York','Paris','Berlin','London'],
    'Salary':[65000,70000,62000,85000]
}
df=pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [6]:
data_List=[
['Jhon',28,'New York',65000],
['Anna',34,'Paris',70000],
['Peter',29,'Berlin',62000],
['Linda',42,'London',85000]
]
df2=pd.DataFrame(data_List)
df2

       0   1         2      3
0   Jhon  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [7]:
columns = ["Name","Age","City","Salary"]
df3 = pd.DataFrame(data_List,columns=columns)
df3

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

Selection and Indexing of Columns

In [8]:
df3

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [11]:
df3['Name']

0     Jhon
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [12]:
df3[['Name','City']]

    Name      City
0   Jhon  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

Creating New Columns

In [13]:
df3["Designaton"]=['HR',"CEO",'CTO','Manager']

In [14]:
df3

    Name  Age      City  Salary Designaton
0   Jhon   28  New York   65000         HR
1   Anna   34     Paris   70000        CEO
2  Peter   29    Berlin   62000        CTO
3  Linda   42    London   85000    Manager

Removing Column

In [17]:
df3.drop("Designaton",axis=1)

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [18]:
df3

    Name  Age      City  Salary Designaton
0   Jhon   28  New York   65000         HR
1   Anna   34     Paris   70000        CEO
2  Peter   29    Berlin   62000        CTO
3  Linda   42    London   85000    Manager

In [19]:
df3.drop("Designaton",axis=1,inplace=True)

In [20]:
df3

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [21]:
df3.drop(0,axis=0)

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000
3  Linda   42  London   85000

Selecting Rows

In [22]:
df3

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [24]:
df3.loc[[0,1]]

   Name  Age      City  Salary
0  Jhon   28  New York   65000
1  Anna   34     Paris   70000

In [25]:
df.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

Selecting Subsets of Rows and Columns

In [26]:
df.loc[[0,1]][['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [27]:
df.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

Conditional Selection

In [28]:
df3

    Name  Age      City  Salary
0   Jhon   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [30]:
#Those people Whose Age is Aabove 30
df3[df3['Age']>30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [34]:
# Those People Whose age is above 30 and Their city must be Paris
df3[(df3['Age']>30) & (df3['City']=='Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000